In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np. random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),index="A B C D E".split(),columns="W X Y Z".split())

In [6]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [9]:
df[["W", "X"]]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [11]:
df[["W"]]

          W
A  0.302665
B -0.134841
C  0.807706
D -0.497104
E -0.116773

In [12]:
df["W"]

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [13]:
df["neu"] = df["W"] + df["Y"]

In [14]:
df

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [15]:
df.drop("neu", axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [16]:
df

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [17]:
df.loc["A"]

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
neu   -1.403420
Name: A, dtype: float64

In [18]:
df.iloc[0]

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
neu   -1.403420
Name: A, dtype: float64

df.iloc gibt den Index aus, während df.loc den Key ausgibt

In [19]:
df.loc["B", "Y"]

0.16690463609281317

In [20]:
df.loc[["A","B"],["Y","Z"]]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [21]:
df

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [22]:
df>0

       W      X      Y      Z    neu
A   True   True  False  False  False
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [23]:
df[df>0]

          W         X         Y         Z       neu
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  0.121354

In [24]:
df["W"]>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [25]:
df[df["W"]>0]

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
C  0.807706  0.072960  0.638787  0.329646  1.446493

Dies zeigt alle Zeilen des DataFrame an, wo die Werte in der Spalte W größer als Null sind. 
Sind die Werte kleiner in der Spalte W, so wird die komplette Zeile (hier B, D und E) nicht ausgegeben.

Anschließend kann man sich dann eine beliebige Spalte ausgeben lassen auf die die obige Bedingung zutrifft:

In [26]:
df[df["W"]>0]["Y"]

A   -1.706086
C    0.638787
Name: Y, dtype: float64

Die Werte der Zeilen A und C sind in Spalte W größer als Null und nun werden die Zwei Werte der Spalte Y ausgegeben.
Spalte W ist die Bedingung und Spalte Y wird hier explizit ausgewählt und angezeigt.

In [28]:
df[df["W"]>0][["Y","X"]]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [33]:
df[(df["W"]>0) & (df["X"]>1)]

          W         X         Y         Z      neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.40342

In [34]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
C  0.807706  0.072960  0.638787  0.329646  1.446493

In [35]:
df

          W         X         Y         Z       neu
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [36]:
df.reset_index()

  index         W         X         Y         Z       neu
0     A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
1     B -0.134841  0.390528  0.166905  0.184502  0.032064
2     C  0.807706  0.072960  0.638787  0.329646  1.446493
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
4     E -0.116773  1.901755  0.238127  1.996652  0.121354

In [37]:
neuind = "BY BW HH BB NW".split()

In [39]:
df["Staaten"]=neuind

In [40]:
df

          W         X         Y         Z       neu Staaten
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420      BY
B -0.134841  0.390528  0.166905  0.184502  0.032064      BW
C  0.807706  0.072960  0.638787  0.329646  1.446493      HH
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510      BB
E -0.116773  1.901755  0.238127  1.996652  0.121354      NW

In [42]:
df.set_index("Staaten")

                W         X         Y         Z       neu
Staaten
BY       0.302665  1.693723 -1.706086 -1.159119 -1.403420
BW      -0.134841  0.390528  0.166905  0.184502  0.032064
HH       0.807706  0.072960  0.638787  0.329646  1.446493
BB      -0.497104 -0.754070 -0.943406  0.484752 -1.440510
NW      -0.116773  1.901755  0.238127  1.996652  0.121354

In [43]:
df

          W         X         Y         Z       neu Staaten
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420      BY
B -0.134841  0.390528  0.166905  0.184502  0.032064      BW
C  0.807706  0.072960  0.638787  0.329646  1.446493      HH
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510      BB
E -0.116773  1.901755  0.238127  1.996652  0.121354      NW

df.set_index("Staaten", inplace=true)

Obige Funktion ersetzt den Index dauerhaft durch die Staaten Bezeichnung